iPig/src/InformationRegisters/КарточкаХряка/КарточкаХряка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КарточкаХряка</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>МассаВыбытие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПричины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаВыбытия</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоОтец</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОтец</name>
    <type>
      <types>CatalogRef.Порода</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоМать</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыМать</name>
    <type>
      <types>CatalogRef.Порода</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСлучка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоСвиноматка</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРожденияСвиноматка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыСвиноматка</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыбытиеСвиноматка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаВыбытияСвиноматка</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодРаботника</name>
    <type>
      <types>CatalogRef.Работник</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпоросаСвиноматка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипВыбытие</name>
    <type>
      <types>EnumRef.ТипВыбытие</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DGTagId</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DanAvlTagID</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/КарточкаХряка/ManagerModule.bsl
Функция ПолучитьДанныеРодителей(НомерЖивотного, ДатаВвода) Экспорт
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КарточкаХряка.НомерЖивотногоОтец КАК НомерЖивотногоОтец,
		|	КарточкаХряка.НомерЖивотногоМать КАК НомерЖивотногоМать,
		|	КарточкаХряка.ДатаРождения КАК ДатаРождения,
		|	КарточкаХряка.КодПороды КАК КодПороды
		|ИЗ
		|	РегистрСведений.КарточкаХряка КАК КарточкаХряка
		|ГДЕ
		|	КарточкаХряка.НомерЖивотного = &НомерЖивотного
		|	И КарточкаХряка.Период = &ДатаВвода";
	
	Запрос.УстановитьПараметр("ДатаВвода", ДатаВвода);
	Запрос.УстановитьПараметр("НомерЖивотного", НомерЖивотного);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ДанныеРодителей = Новый Структура;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДанныеРодителей.Вставить("Отец",ВыборкаДетальныеЗаписи.НомерЖивотногоОтец);
		ДанныеРодителей.Вставить("Мать",ВыборкаДетальныеЗаписи.НомерЖивотногоМать); 
		ДанныеРодителей.Вставить("ДатаРождения",ВыборкаДетальныеЗаписи.ДатаРождения);
		ДанныеРодителей.Вставить("КодПороды",ВыборкаДетальныеЗаписи.КодПороды);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
   Возврат ДанныеРодителей;
КонецФункции
